#encoding:utf-8
require 'mechanize'
require 'nokogiri'
require 'json'
require 'csv'
class Crawler < ActiveRecord::Base
	class << self
		def save_datas
			urls = get_urls
			p "=========共#{urls.size}个url"
			i = 0
			urls.each do |url|
				i +=1
				save_data(url)
				p "--------number:#{i}"
				p '--------sleep'
				sleep(20)
			end
		end

		def save_data(url)
			mechanize = Mechanize.new
			page = mechanize.get(url) rescue nil
			return  if page.nil?
			#视频分类
			return if (page.css('div .item-moreshow ul li span').empty?)
			v_class = page.css('div .item-moreshow ul li span')[0].text if page.css('div .item-moreshow ul li span')[0]
			v_type = page.css('div .item-moreshow ul li span')[1].text if page.css('div .item-moreshow ul li span')[1]
			return  if (v_class.nil? || v_type.nil?|| v_class.empty?|| v_type.empty?)
			if !(page.css('div .p-meta-title a').empty?)
				page.css('div .p-meta-title a').each do |video_link|
					v_title = video_link["title"]
					crawler = Crawler.where(category:v_class,v_type:v_type,title:v_title).first
					crawler||=Crawler.new(category:v_class,v_type:v_type,title:v_title)
					crawler.save rescue nil
				end
			elsif !(page.css('div .v-meta-title a').empty?)
				page.css('div .v-meta-title a').each do |video_link|
					v_title = video_link["title"]
					crawler = Crawler.where(category:v_class,v_type:v_type,title:v_title).first
					crawler||=Crawler.new(category:v_class,v_type:v_type,title:v_title)
					crawler.save rescue nil
				end
			else
				return
			end
		end

		def get_urls
			get_tv_to_documentary_urls + get_news_to_joke_urls
		end

		def get_tv_to_documentary_urls
			urls = []
			#资讯之前的都遵循下面的规则
			#["c_84"=>"纪录片","c_85"=>"综艺", "c_87"=>"教育","c_91"=>"资讯","c_95"=>"音乐", "c_96"=>"电影", "c_97"=>"电视剧","c_100"=>"动漫"]
			categories = ["c_97", "c_96", "c_85", "c_100", "c_87", "c_84","c_91","c_95"]
			#把每个频道包含的类型添加进来
			channel_type = {"c_84"=>["c84_人物","c84_军事","c84_历史","c84_自然","c84_古迹","c84_探险","c84_科技","c84_文化","c84_刑侦","c84_社会","c84_旅游"],
							"c_85"=>["c85_优酷出品","c85_优酷牛人","c85_脱口秀","c85_真人秀","c85_选秀","c85_美食","c85_旅游","c85_汽车","c85_访谈","c85_记实","c85_搞笑","c85_时尚","c85_晚会","c85_理财","c85_演唱会","c85_曲艺","c85_益智","c85_音乐","c85_舞蹈","c85_体育娱乐","c85_游戏","c85_生活"],
							"c_87"=>["c87_公开课","c87_名人名嘴","c87_文化","c87_艺术","c87_伦理社会","c87_理工","c87_历史","c87_心理学","c87_经济","c87_政治","c87_管理学","c87_外语","c87_法律","c87_计算机","c87_哲学","c87_职业培训","c87_家庭教育"],
							"c_91"=>["c91_时政","c91_财经","c91_社会","c91_生活","c91_军事","c91_科技","c91_体育","c91_公益"],
							"c_95"=>["c95_流行","c95_摇滚","c95_舞曲","c95_电子","c95_R&B","c95_HIP-HOP","c95_乡村","c95_民族","c95_民谣","c95_拉丁","c95_爵士","c95_雷鬼","c95_新世纪","c95_古典","c95_音乐剧","c95_轻音乐"],
							"c_96"=>["c96_武侠","c96_警匪","c96_犯罪","c96_科幻","c96_战争","c96_恐怖","c96_惊悚","c96_纪录片","c96_西部","c96_戏曲","c96_歌舞","c96_奇幻","c96_冒险","c96_悬疑","c96_历史","c96_动作","c96_传记","c96_动画","c96_儿童","c96_喜剧","c96_爱情","c96_剧情","c96_运动","c96_短片","c96_优酷出品"],
							"c_97"=>["c97_古装","c97_武侠","c97_警匪","c97_军事","c97_神话","c97_科幻","c97_悬疑","c97_历史","c97_儿童","c97_农村","c97_都市","c97_家庭","c97_搞笑","c97_偶像","c97_言情","c97_时装","c97_优酷出品"],
							"c_100"=>["c100_热血","c100_格斗","c100_恋爱","c100_美少女","c100_校园","c100_搞笑","c100_LOLI","c100_神魔","c100_机战","c100_科幻","c100_真人","c100_青春","c100_魔法","c100_神话","c100_冒险","c100_运动","c100_竞技","c100_童话","c100_亲子","c100_教育","c100_励志","c100_剧情","c100_社会","c100_历史","c100_战争"]
						}

			#把他们每个类型对应的页数添加进来
			channel_type_page = {
								"c84_人物"=>29,"c84_军事"=>9,"c84_历史"=>29,"c84_自然"=>23,"c84_古迹"=>5,"c84_探险"=>11,"c84_科技"=>11,"c84_文化"=>29,"c84_刑侦"=>4,"c84_社会"=>29,"c84_旅游"=>7,
								"c85_优酷出品"=>7,"c85_优酷牛人"=>3,"c85_脱口秀"=>19,"c85_真人秀"=>29,"c85_选秀"=>11,"c85_美食"=>17,"c85_旅游"=>16,"c85_汽车"=>4,"c85_访谈"=>29,"c85_记实"=>8,"c85_搞笑"=>19,"c85_时尚"=>17,"c85_晚会"=>24,"c85_理财"=>4,"c85_演唱会"=>1,"c85_曲艺"=>6,"c85_益智"=>11,"c85_音乐"=>29,"c85_舞蹈"=>4,"c85_体育娱乐"=>1,"c85_游戏"=>15,"c85_生活"=>29,
								"c87_公开课"=>8,"c87_名人名嘴"=>4,"c87_文化"=>5,"c87_艺术"=>3,"c87_伦理社会"=>1,"c87_理工"=>3,"c87_历史"=>2,"c87_心理学"=>1,"c87_经济"=>1,"c87_政治"=>1,"c87_管理学"=>1,"c87_外语"=>2,"c87_法律"=>1,"c87_计算机"=>1,"c87_哲学"=>1,"c87_职业培训"=>3,"c87_家庭教育"=>3,
								"c91_时政"=>6,"c91_财经"=>15,"c91_社会"=>16,"c91_生活"=>11,"c91_军事"=>3,"c91_科技"=>2,"c91_体育"=>6,"c91_公益"=>1,
								"c95_流行"=>20,"c95_摇滚"=>20,"c95_舞曲"=>20,"c95_电子"=>20,"c95_R&B"=>20,"c95_HIP-HOP"=>20,"c95_乡村"=>20,"c95_民族"=>11,"c95_民谣"=>20,"c95_拉丁"=>8,"c95_爵士"=>10,"c95_雷鬼"=>6,"c95_新世纪"=>2,"c95_古典"=>4,"c95_音乐剧"=>1,"c95_轻音乐"=>8,
								"c96_武侠"=>8,"c96_警匪"=>1,"c96_犯罪"=>29,"c96_科幻"=>29,"c96_战争"=>29,"c96_恐怖"=>29,"c96_惊悚"=>29,"c96_纪录片"=>29,"c96_西部"=>29,"c96_戏曲"=>16,"c96_歌舞"=>29,"c96_奇幻"=>29,"c96_冒险"=>29,"c96_悬疑"=>29,"c96_历史"=>29,"c96_动作"=>29,"c96_传记"=>29,"c96_动画"=>29,"c96_儿童"=>6,"c96_喜剧"=>29,"c96_爱情"=>29,"c96_剧情"=>29,"c96_运动"=>9,"c96_短片"=>29,"c96_优酷出品"=>2,
								"c97_古装"=>29,"c97_武侠"=>13,"c97_警匪"=>29,"c97_军事"=>26,"c97_神话"=>6,"c97_科幻"=>16,"c97_悬疑"=>29,"c97_历史"=>29,"c97_儿童"=>3,"c97_农村"=>8,"c97_都市"=>29,"c97_家庭"=>29,"c97_搞笑"=>29,"c97_偶像"=>29,"c97_言情"=>29,"c97_时装"=>29,"c97_优酷出品"=>1,
								"c100_热血"=>16,"c100_格斗"=>13,"c100_恋爱"=>17,"c100_美少女"=>22,"c100_校园"=>18,"c100_搞笑"=>29,"c100_LOLI"=>4,"c100_神魔"=>12,"c100_机战"=>10,"c100_科幻"=>4,"c100_真人"=>6,"c100_青春"=>11,"c100_魔法"=>14,"c100_神话"=>4,"c100_冒险"=>29,"c100_运动"=>5,"c100_竞技"=>6,"c100_童话"=>17,"c100_亲子"=>21,"c100_教育"=>21,"c100_励志"=>8,"c100_剧情"=>29,"c100_社会"=>7,"c100_历史"=>6,"c100_战争"=>7
							}
			categories.each do |category|
				next if channel_type[category].nil?
				channel_type[category].each do |title|
					convert_title = title.split("_").last
					convert_title = CGI::escape(convert_title)
					page = channel_type_page[title]
					page.times{|i| urls << "http://www.youku.com/v_olist/#{category}_g_#{convert_title}_a__sg__mt__lg__q__s_1_r_0_u_0_pt_0_av_0_ag_0_sg__pr__h__d_2_p_#{i+1}.html" } if page
				end
			end
			urls
		end

		def get_news_to_joke_urls
			urls = []
			#url变化从资讯的仅视频开始
			#["c86"=>"娱乐","c87"=>"教育","c88"=>"旅游","c89"=>"时尚","c90"=>"亲子","c91"=>"资讯","c94"=>"搞笑","c95"=>"音乐","c98"=>"体育","c99"=>"游戏","c103"=>"生活","c104"=>"汽车","c105"=>"科技"]
			another_group_categories = ["c91","c86","c87","c88","c89","c90","c94","c95","c98","c99","c103","c104","c105"]
			another_group_channel_type = {
										"c91"=>["c91_2143","c91_2147","c91_2148","c91_2144","c91_258","c91_308","c91_2351"],
										"c86"=>["c86_2146","c86_2077","c86_2067","c86_2142","c86_2076","c86_2312","c86_2309","c86_2311","c86_2350"],
										"c87"=>["c87_248","c87_250","c87_253","c87_2353","c87_251","c87_252","c87_2354","c87_254","c87_255","c87_256"],
										"c88"=>["c88_2342","c88_2348","c88_2347","c88_2346","c88_2345","c88_2344","c88_2343","c88_2333","c88_2332","c88_2331","c88_2330","c88_2329","c88_2349"],
										"c89"=>["c89_2319","c89_2320","c89_2321","c89_2322","c89_2323","c89_2324"],
										"c90"=>["c90_2314","c90_2315","c90_2316","c90_2317","c90_2318","c90_237"],
										"c94"=>["c94_235","c94_236","c94_238"],
										"c95"=>["c95_2122","c95_2123","c95_2124","c95_2140","c95_2232","c95_2141","c95_2125","c95_2136","c95_2137","c95_2138","c95_2126","c95_2133","c95_2127","c95_2128","c95_2132","c95_2129","c95_2130","c95_2131","c95_2134","c95_2135","c95_2139","c95_2098","c95_3064","c95_3065","c95_3066"],
										"c99"=>["c99_2222","c99_2221","c99_2213","c99_2218","c99_2219","c99_2230","c99_2231","c99_2352"],
										"c98"=>["c98_3063","c98_2121","c98_2086","c98_2114","c98_2085","c98_2108","c98_2104","c98_2103","c98_2102","c98_2101","c98_2355","c98_2099","c98_2095","c98_2362","c98_2087","c98_2097","c98_2088","c98_2093","c98_2092","c98_2096","c98_2361","c98_2360","c98_2359","c98_2358","c98_2091","c98_2357","c98_2356","c98_2105","c98_2120","c98_2118"],
										"c103"=>["c103_240","c103_3061","c103_3060","c103_2341","c103_2327","c103_2326","c103_247","c103_244","c103_243","c103_242","c103_3062"],
										"c104"=>["c104_263","c104_291","c104_277","c104_290","c104_276","c104_304","c104_305","c104_303","c104_306","c104_289","c104_293","c104_294","c104_295","c104_296","c104_297","c104_298","c104_299",
												"c104_300","c104_301","c104_302","c104_292","c104_268","c104_270","c104_286","c104_2094","c104_275","c104_264","c104_265","c104_266","c104_267","c104_269","c104_278","c104_307","c104_2119"],
										"c105"=>["c105_259","c105_3056","c105_2340","c105_2339","c105_2338","c105_2337","c105_2336","c105_2335","c105_2334","c105_262","c105_3057"]
			}
			#从汽车开始设置固定值 20
			another_group_channel_type_page = {
										"c87_248"=>20,"c87_250"=>20,"c87_253"=>20,"c87_2353"=>20,"c87_2520"=>20,"c87_252"=>20,"c87_2354"=>20,"c87_254"=>20,"c87_255"=>20,"c87_256"=>20,
										"c88_2342"=>20,"c88_2348"=>20,"c88_2347"=>20,"c88_2346"=>20,"c88_2345"=>20,"c88_2344"=>20,"c88_2343"=>20,"c88_2333"=>20,"c88_2332"=>20,"c88_2331"=>20,"c88_2330"=>20,"c88_2329"=>20,"c88_2349"=>20,
										"c89_2319"=>20,"c89_2320"=>20,"c89_2321"=>20,"c89_2322"=>20,"c89_2323"=>20,"c89_2324"=>20,
										"c90_2314"=>20,"c90_2315"=>20,"c90_2316"=>20,"c90_2317"=>20,"c90_2318"=>20,"c90_237"=>20,
										"c91_2143"=>20,"c91_2147"=>11,"c91_2148"=>20,"c91_2144"=>7,"c91_258"=>7,"c91_308"=>20,"c91_2351"=>9,
										"c86_2146"=>20,"c86_2077"=>20,"c86_2067"=>17,"c86_2142"=>5,"c86_2076"=>5,"c86_2312"=>9,"c86_2309"=>20,"c86_2311"=>17,"c86_2350"=>15,
										"c94_235"=>20,"c94_236"=>20,"c94_238"=>20,
										"c95_2122"=>20,"c95_2123"=>20,"c95_2124"=>20,"c95_2140"=>20,"c95_2232"=>20,"c95_2141"=>20,"c95_2125"=>20,"c95_2136"=>20,"c95_2137"=>20,"c95_2138"=>20,"c95_2126"=>20,"c95_2133"=>20,"c95_2127"=>20,"c95_2128"=>20,"c95_2132"=>20,"c95_2129"=>20,"c95_2130"=>20,"c95_2131"=>20,"c95_2134"=>20,"c95_2135"=>20,"c95_2139"=>20,"c95_2098"=>20,"c95_3064"=>20,"c95_3065"=>20,"c95_3066"=>20,
										"c98_3063"=>1,"c98_2121"=>20,"c98_2086"=>20,"c98_2114"=>1,"c98_2085"=>1,"c98_2108"=>1,"c98_2104"=>8,"c98_2103"=>6,"c98_2102"=>14,"c98_2101"=>5,"c98_2355"=>6,"c98_2099"=>20,"c98_2095"=>20,"c98_2362"=>2,"c98_2087"=>4,"c98_2097"=>20,"c98_2088"=>1,"c98_2093"=>5,"c98_2092"=>7,"c98_2096"=>2,"c98_2361"=>20,"c98_2360"=>2,"c98_2359"=>20,"c98_2358"=>20,"c98_2091"=>20,"c98_2357"=>9,"c98_2356"=>18,"c98_2105"=>4,"c98_2120"=>1,"c98_2118"=>1,
										"c99_2222"=>20,"c99_2221"=>20,"c99_2213"=>20,"c99_2218"=>20,"c99_2219"=>20,"c99_2230"=>20,"c99_2231"=>20,"c99_2352"=>20,
										"c103_240"=>20,"c103_3061"=>20,"c103_3060"=>20,"c103_2341"=>20,"c103_2327"=>20,"c103_2326"=>20,"c103_247"=>20,"c103_244"=>20,"c103_243"=>20,"c103_242"=>20,"c103_3062"=>20,
										"c104_263"=>20,"c104_291"=>20,"c104_277"=>20,"c104_290"=>20,"c104_276"=>20,"c104_304"=>20,"c104_305"=>20,"c104_303"=>20,"c104_306"=>20,"c104_289"=>20,"c104_293"=>20,"c104_294"=>20,"c104_295"=>20,"c104_296"=>20,"c104_297"=>20,"c104_298"=>20,"c104_299"=>20,
										"c104_300"=>20,"c104_301"=>20,"c104_302"=>20,"c104_292"=>20,"c104_268"=>20,"c104_270"=>20,"c104_286"=>20,"c104_2094"=>20,"c104_275"=>20,"c104_264"=>20,"c104_265"=>20,"c104_266"=>20,"c104_267"=>20,"c104_269"=>20,"c104_278"=>20,"c104_307"=>20,"c104_2119"=>20,
										"c105_259"=>20,"c105_3056"=>20,"c105_2340"=>20,"c105_2339"=>20,"c105_2338"=>20,"c105_2337"=>20,"c105_2336"=>20,"c105_2335"=>20,"c105_2334"=>20,"c105_262"=>20,"c105_3057"=>20
			}
			another_group_categories.each do |category|
				next if another_group_channel_type[category].nil?
				another_group_channel_type[category].each do |title|
					convert_title = title.split("_").last
					page = another_group_channel_type_page[title]
					page.times{|i| urls << "http://www.youku.com/v_showlist/#{category}g#{convert_title}d2s1p#{i+1}.html" } if page
				end
			end
			urls
		end

		def export_datas
			CSV.open("#{Rails.root}/public/crawler.csv", "w") do |csv|
				csv << ["category","v_type","title"]
				Crawler.all.each do |crawler|
					csv << [crawler.category,crawler.v_type,crawler.title]
				end
			end
		end
	end
end